cmsis-svd/cmsis-svd/data/Nuvoton/NUC122_v1.svd
       <register derivedFrom="GPIOA_PMD">
          <name>GPIOB_PMD</name>
          <displayName>GPIOB_PMD</displayName>
          <description>GPIO Port B Pin I/O Mode Control</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="GPIOA_OFFD">
          <name>GPIOB_OFFD</name>
          <displayName>GPIOB_OFFD</displayName>
          <description>GPIO Port B Pin OFF Digital Enable</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register derivedFrom="GPIOA_DOUT">
          <name>GPIOB_DOUT</name>
          <displayName>GPIOB_DOUT</displayName>
          <description>GPIO Port B Data Output Value</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register derivedFrom="GPIOA_DMASK">
          <name>GPIOB_DMASK</name>
          <displayName>GPIOB_DMASK</displayName>
          <description>GPIO Port B Data Output Write Mask</description>
          <addressOffset>0x4C</addressOffset>
       </register>
       <register derivedFrom="GPIOA_PIN">
          <name>GPIOB_PIN</name>
          <displayName>GPIOB_PIN</displayName>
          <description>GPIO Port B Pin Value</description>
          <addressOffset>0x50</addressOffset>
       </register>
       <register derivedFrom="GPIOA_DBEN">
          <name>GPIOB_DBEN</name>
          <displayName>GPIOB_DBEN</displayName>
          <description>GPIO Port B De-bounce Enable</description>
          <addressOffset>0x54</addressOffset>
       </register>
       <register derivedFrom="GPIOA_IMD">
          <name>GPIOB_IMD</name>
          <displayName>GPIOB_IMD</displayName>
          <description>GPIO Port B Interrupt Mode Control</description>
          <addressOffset>0x58</addressOffset>
       </register>
       <register derivedFrom="GPIOA_IEN">
          <name>GPIOB_IEN</name>
          <displayName>GPIOB_IEN</displayName>
          <description>GPIO Port B Interrupt Enable</description>
          <addressOffset>0x5C</addressOffset>
       </register>
       <register derivedFrom="GPIOA_ISRC">
          <name>GPIOB_ISRC</name>
          <displayName>GPIOB_ISRC</displayName>
          <description>GPIO Port B Interrupt Trigger Source Indicator</description>
          <addressOffset>0x60</addressOffset>
       </register>
       <register derivedFrom="GPIOA_PMD">
          <name>GPIOC_PMD</name>
          <displayName>GPIOC_PMD</displayName>
          <description>GPIO Port C Pin I/O Mode Control</description>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="GPIOA_OFFD">
          <name>GPIOC_OFFD</name>
          <displayName>GPIOC_OFFD</displayName>
          <description>GPIO Port C Pin OFF Digital Enable</description>
          <addressOffset>0x84</addressOffset>
       </register>
       <register derivedFrom="GPIOA_DOUT">
          <name>GPIOC_DOUT</name>
          <displayName>GPIOC_DOUT</displayName>
          <description>GPIO Port C Data Output Value</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register derivedFrom="GPIOA_DMASK">
          <name>GPIOC_DMASK</name>
          <displayName>GPIOC_DMASK</displayName>
          <description>GPIO Port C Data Output Write Mask</description>
          <addressOffset>0x8C</addressOffset>
       </register>
       <register derivedFrom="GPIOA_PIN">
          <name>GPIOC_PIN</name>
          <displayName>GPIOC_PIN</displayName>
          <description>GPIO Port C Pin Value</description>
          <addressOffset>0x90</addressOffset>
       </register>
       <register derivedFrom="GPIOA_DBEN">
          <name>GPIOC_DBEN</name>
          <displayName>GPIOC_DBEN</displayName>
          <description>GPIO Port C De-bounce Enable</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register derivedFrom="GPIOA_IMD">
          <name>GPIOC_IMD</name>
          <displayName>GPIOC_IMD</displayName>
          <description>GPIO Port C Interrupt Mode Control</description>
          <addressOffset>0x98</addressOffset>
       </register>
       <register derivedFrom="GPIOA_IEN">
          <name>GPIOC_IEN</name>
          <displayName>GPIOC_IEN</displayName>
          <description>GPIO Port C Interrupt Enable</description>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register derivedFrom="GPIOA_ISRC">
          <name>GPIOC_ISRC</name>
          <displayName>GPIOC_ISRC</displayName>
          <description>GPIO Port C Interrupt Trigger Source Indicator</description>
          <addressOffset>0xA0</addressOffset>
       </register>
       <register derivedFrom="GPIOA_PMD">
          <name>GPIOD_PMD</name>
          <displayName>GPIOD_PMD</displayName>
          <description>GPIO Port D Pin I/O Mode Control</description>
          <addressOffset>0xC0</addressOffset>
       </register>
       <register derivedFrom="GPIOA_OFFD">
          <name>GPIOD_OFFD</name>
          <displayName>GPIOD_OFFD</displayName>
          <description>GPIO Port D Pin OFF Digital Enable</description>
          <addressOffset>0xC4</addressOffset>
       </register>
       <register derivedFrom="GPIOA_DOUT">
          <name>GPIOD_DOUT</name>
          <displayName>GPIOD_DOUT</displayName>
          <description>GPIO Port D Data Output Value</description>
          <addressOffset>0xC8</addressOffset>
       </register>
       <register derivedFrom="GPIOA_DMASK">
          <name>GPIOD_DMASK</name>
          <displayName>GPIOD_DMASK</displayName>
          <description>GPIO Port D Data Output Write Mask</description>
          <addressOffset>0xCC</addressOffset>
       </register>
       <register derivedFrom="GPIOA_PIN">
          <name>GPIOD_PIN</name>
          <displayName>GPIOD_PIN</displayName>
          <description>GPIO Port D Pin Value</description>
          <addressOffset>0xD0</addressOffset>
       </register>
       <register derivedFrom="GPIOA_DBEN">
          <name>GPIOD_DBEN</name>
          <displayName>GPIOD_DBEN</displayName>
          <description>GPIO Port D De-bounce Enable</description>
          <addressOffset>0xD4</addressOffset>
       </register>
       <register derivedFrom="GPIOA_IMD">
          <name>GPIOD_IMD</name>
          <displayName>GPIOD_IMD</displayName>
          <description>GPIO Port D Interrupt Mode Control</description>
          <addressOffset>0xD8</addressOffset>
       </register>
       <register derivedFrom="GPIOA_IEN">
          <name>GPIOD_IEN</name>
          <displayName>GPIOD_IEN</displayName>
          <description>GPIO Port D Interrupt Enable</description>
          <addressOffset>0xDC</addressOffset>
       </register>
       <register derivedFrom="GPIOA_ISRC">
          <name>GPIOD_ISRC</name>
          <displayName>GPIOD_ISRC</displayName>
          <description>GPIO Port D Interrupt Trigger Source Indicator</description>
          <addressOffset>0xE0</addressOffset>
       </register>
       <register>
          <name>DBNCECON</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DBNCECON</displayName>
          <description>De-bounce Cycle Control</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBCLKSEL</name>
              <description>De-bounce Sampling Cycle Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBCLKSRC</name>
              <description>De-bounce Counter Clock Source Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>De-bounce counter clock source is the HCLK</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>De-bounce counter clock source is the internal 10 KHz low speed clock</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ICLK_ON</name>
              <description>Interrupt Clock On Mode\nSet this bit to 0 will disable the interrupt generate circuit clock, if the pin[n] interrupt is disabled</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disable the clock if the GPIOA/B/C/D[n] interrupt is disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Interrupt generated circuit clock always enable</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>GPIOA0_DOUT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>GPIOA0_DOUT</displayName>
          <description>GPIO PA.0 Bit Output/Input Value</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <fields>
            <field>
              <name>GPIOxx_DOUT</name>
              <description>GPIOxx I/O Pin Bit Output/Input Control\nWrite this bit can control one GPIO pin output value\nRead this register to get IO pin status.\nFor example: write GPIOA0_DOUT will reflect the written value to bit GPIOA_DOUT[0], read GPIOA0_DOUT will return the value of GPIOA_PIN[0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Set corresponding GPIO pin to low</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Set corresponding GPIO pin to high</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOA1_DOUT</name>
          <displayName>GPIOA1_DOUT</displayName>
          <description>GPIO PA.1 Bit Output/Input Value</description>
          <addressOffset>0x204</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOA2_DOUT</name>
          <displayName>GPIOA2_DOUT</displayName>
          <description>GPIO PA.2 Bit Output/Input Value</description>
          <addressOffset>0x208</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOA3_DOUT</name>
          <displayName>GPIOA3_DOUT</displayName>
          <description>GPIO PA.3 Bit Output/Input Value</description>
          <addressOffset>0x20C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOA4_DOUT</name>
          <displayName>GPIOA4_DOUT</displayName>
          <description>GPIO PA.4 Bit Output/Input Value</description>
          <addressOffset>0x210</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOA5_DOUT</name>
          <displayName>GPIOA5_DOUT</displayName>
          <description>GPIO PA.5 Bit Output/Input Value</description>
          <addressOffset>0x214</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOA6_DOUT</name>
          <displayName>GPIOA6_DOUT</displayName>
          <description>GPIO PA.6 Bit Output/Input Value</description>
          <addressOffset>0x218</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOA7_DOUT</name>
          <displayName>GPIOA7_DOUT</displayName>
          <description>GPIO PA.7 Bit Output/Input Value</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOA8_DOUT</name>
          <displayName>GPIOA8_DOUT</displayName>
          <description>GPIO PA.8 Bit Output/Input Value</description>
          <addressOffset>0x220</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOA9_DOUT</name>
          <displayName>GPIOA9_DOUT</displayName>
          <description>GPIO PA.9 Bit Output/Input Value</description>
          <addressOffset>0x224</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOA10_DOUT</name>
          <displayName>GPIOA10_DOUT</displayName>
          <description>GPIO PA.10 Bit Output/Input Value</description>
          <addressOffset>0x228</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOA11_DOUT</name>
          <displayName>GPIOA11_DOUT</displayName>
          <description>GPIO PA.11 Bit Output/Input Value</description>
          <addressOffset>0x22C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOA12_DOUT</name>
          <displayName>GPIOA12_DOUT</displayName>
          <description>GPIO PA.12 Bit Output/Input Value</description>
          <addressOffset>0x230</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOA13_DOUT</name>
          <displayName>GPIOA13_DOUT</displayName>
          <description>GPIO PA.13 Bit Output/Input Value</description>
          <addressOffset>0x234</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOA14_DOUT</name>
          <displayName>GPIOA14_DOUT</displayName>
          <description>GPIO PA.14 Bit Output/Input Value</description>
          <addressOffset>0x238</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOA15_DOUT</name>
          <displayName>GPIOA15_DOUT</displayName>
          <description>GPIO PA.15 Bit Output/Input Value</description>
          <addressOffset>0x23C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOB0_DOUT</name>
          <displayName>GPIOB0_DOUT</displayName>
          <description>GPIO PB.0 Bit Output/Input Value</description>
          <addressOffset>0x240</addressOffset>
       </register>
