cmsis-svd/cmsis-svd/data/Nuvoton/NUC122_v1.svd
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB1_DOUT</name>
          <displayName>GPIOB1_DOUT</displayName>
          <description>GPIO PB.1 Bit Output/Input Value</description>
          <addressOffset>0x244</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB2_DOUT</name>
          <displayName>GPIOB2_DOUT</displayName>
          <description>GPIO PB.2 Bit Output/Input Value</description>
          <addressOffset>0x248</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB3_DOUT</name>
          <displayName>GPIOB3_DOUT</displayName>
          <description>GPIO PB.3 Bit Output/Input Value</description>
          <addressOffset>0x24C</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB4_DOUT</name>
          <displayName>GPIOB4_DOUT</displayName>
          <description>GPIO PB.4 Bit Output/Input Value</description>
          <addressOffset>0x250</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB5_DOUT</name>
          <displayName>GPIOB5_DOUT</displayName>
          <description>GPIO PB.5 Bit Output/Input Value</description>
          <addressOffset>0x254</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB6_DOUT</name>
          <displayName>GPIOB6_DOUT</displayName>
          <description>GPIO PB.6 Bit Output/Input Value</description>
          <addressOffset>0x258</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB7_DOUT</name>
          <displayName>GPIOB7_DOUT</displayName>
          <description>GPIO PB.7 Bit Output/Input Value</description>
          <addressOffset>0x25C</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB8_DOUT</name>
          <displayName>GPIOB8_DOUT</displayName>
          <description>GPIO PB.8 Bit Output/Input Value</description>
          <addressOffset>0x260</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB9_DOUT</name>
          <displayName>GPIOB9_DOUT</displayName>
          <description>GPIO PB.9 Bit Output/Input Value</description>
          <addressOffset>0x264</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB10_DOUT</name>
          <displayName>GPIOB10_DOUT</displayName>
          <description>GPIO PB.10 Bit Output/Input Value</description>
          <addressOffset>0x268</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB11_DOUT</name>
          <displayName>GPIOB11_DOUT</displayName>
          <description>GPIO PB.11 Bit Output/Input Value</description>
          <addressOffset>0x26C</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB12_DOUT</name>
          <displayName>GPIOB12_DOUT</displayName>
          <description>GPIO PB.12 Bit Output/Input Value</description>
          <addressOffset>0x270</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB13_DOUT</name>
          <displayName>GPIOB13_DOUT</displayName>
          <description>GPIO PB.13 Bit Output/Input Value</description>
          <addressOffset>0x274</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB14_DOUT</name>
          <displayName>GPIOB14_DOUT</displayName>
          <description>GPIO PB.14 Bit Output/Input Value</description>
          <addressOffset>0x278</addressOffset>
       </register>
       <register derivedFrom="GPIOB0_DOUT">
          <name>GPIOB15_DOUT</name>
          <displayName>GPIOB15_DOUT</displayName>
          <description>GPIO PB.15 Bit Output/Input Value</description>
          <addressOffset>0x27C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOC0_DOUT</name>
          <displayName>GPIOC0_DOUT</displayName>
          <description>GPIO PC.0 Bit Output/Input Value</description>
          <addressOffset>0x280</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC1_DOUT</name>
          <displayName>GPIOC1_DOUT</displayName>
          <description>GPIO PC.1 Bit Output/Input Value</description>
          <addressOffset>0x284</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC2_DOUT</name>
          <displayName>GPIOC2_DOUT</displayName>
          <description>GPIO PC.2 Bit Output/Input Value</description>
          <addressOffset>0x288</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC3_DOUT</name>
          <displayName>GPIOC3_DOUT</displayName>
          <description>GPIO PC.3 Bit Output/Input Value</description>
          <addressOffset>0x28C</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC4_DOUT</name>
          <displayName>GPIOC4_DOUT</displayName>
          <description>GPIO PC.4 Bit Output/Input Value</description>
          <addressOffset>0x290</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC5_DOUT</name>
          <displayName>GPIOC5_DOUT</displayName>
          <description>GPIO PC.5 Bit Output/Input Value</description>
          <addressOffset>0x294</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC6_DOUT</name>
          <displayName>GPIOC6_DOUT</displayName>
          <description>GPIO PC.6 Bit Output/Input Value</description>
          <addressOffset>0x298</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC7_DOUT</name>
          <displayName>GPIOC7_DOUT</displayName>
          <description>GPIO PC.7 Bit Output/Input Value</description>
          <addressOffset>0x29C</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC8_DOUT</name>
          <displayName>GPIOC8_DOUT</displayName>
          <description>GPIO PC.8 Bit Output/Input Value</description>
          <addressOffset>0x2A0</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC9_DOUT</name>
          <displayName>GPIOC9_DOUT</displayName>
          <description>GPIO PC.9 Bit Output/Input Value</description>
          <addressOffset>0x2A4</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC10_DOUT</name>
          <displayName>GPIOC10_DOUT</displayName>
          <description>GPIO PC.10 Bit Output/Input Value</description>
          <addressOffset>0x2A8</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC11_DOUT</name>
          <displayName>GPIOC11_DOUT</displayName>
          <description>GPIO PC.11 Bit Output/Input Value</description>
          <addressOffset>0x2AC</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC12_DOUT</name>
          <displayName>GPIOC12_DOUT</displayName>
          <description>GPIO PC.12 Bit Output/Input Value</description>
          <addressOffset>0x2B0</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC13_DOUT</name>
          <displayName>GPIOC13_DOUT</displayName>
          <description>GPIO PC.13 Bit Output/Input Value</description>
          <addressOffset>0x2B4</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC14_DOUT</name>
          <displayName>GPIOC14_DOUT</displayName>
          <description>GPIO PC.14 Bit Output/Input Value</description>
          <addressOffset>0x2B8</addressOffset>
       </register>
       <register derivedFrom="GPIOC0_DOUT">
          <name>GPIOC15_DOUT</name>
          <displayName>GPIOC15_DOUT</displayName>
          <description>GPIO PC.15 Bit Output/Input Value</description>
          <addressOffset>0x2BC</addressOffset>
       </register>
       <register derivedFrom="GPIOA0_DOUT">
          <name>GPIOD0_DOUT</name>
          <displayName>GPIOD0_DOUT</displayName>
          <description>GPIO PD.0 Bit Output/Input Value</description>
          <addressOffset>0x2C0</addressOffset>
       </register>
       <register derivedFrom="GPIOD0_DOUT">
          <name>GPIOD1_DOUT</name>
          <displayName>GPIOD1_DOUT</displayName>
          <description>GPIO PD.1 Bit Output/Input Value</description>
          <addressOffset>0x2C4</addressOffset>
       </register>
       <register derivedFrom="GPIOD0_DOUT">
          <name>GPIOD2_DOUT</name>
          <displayName>GPIOD2_DOUT</displayName>
          <description>GPIO PD.2 Bit Output/Input Value</description>
          <addressOffset>0x2C8</addressOffset>
       </register>
       <register derivedFrom="GPIOD0_DOUT">
          <name>GPIOD3_DOUT</name>
          <displayName>GPIOD3_DOUT</displayName>
          <description>GPIO PD.3 Bit Output/Input Value</description>
          <addressOffset>0x2CC</addressOffset>
       </register>
       <register derivedFrom="GPIOD0_DOUT">
          <name>GPIOD4_DOUT</name>
          <displayName>GPIOD4_DOUT</displayName>
          <description>GPIO PD.4 Bit Output/Input Value</description>
          <addressOffset>0x2D0</addressOffset>
       </register>
       <register derivedFrom="GPIOD0_DOUT">
          <name>GPIOD5_DOUT</name>
          <displayName>GPIOD5_DOUT</displayName>
          <description>GPIO PD.5 Bit Output/Input Value</description>
          <addressOffset>0x2D4</addressOffset>
       </register>
       <register derivedFrom="GPIOD0_DOUT">
          <name>GPIOD6_DOUT</name>
          <displayName>GPIOD6_DOUT</displayName>
          <description>GPIO PD.6 Bit Output/Input Value</description>
          <addressOffset>0x2D8</addressOffset>
       </register>
       <register derivedFrom="GPIOD0_DOUT">
          <name>GPIOD7_DOUT</name>
          <displayName>GPIOD7_DOUT</displayName>
          <description>GPIO PD.7 Bit Output/Input Value</description>
          <addressOffset>0x2DC</addressOffset>
       </register>
       <register derivedFrom="GPIOD0_DOUT">
          <name>GPIOD8_DOUT</name>
          <displayName>GPIOD8_DOUT</displayName>
          <description>GPIO PD.8 Bit Output/Input Value</description>
          <addressOffset>0x2E0</addressOffset>
       </register>
       <register derivedFrom="GPIOD0_DOUT">
          <name>GPIOD9_DOUT</name>
          <displayName>GPIOD9_DOUT</displayName>
          <description>GPIO PD.9 Bit Output/Input Value</description>
          <addressOffset>0x2E4</addressOffset>
       </register>
       <register derivedFrom="GPIOD0_DOUT">
          <name>GPIOD10_DOUT</name>
          <displayName>GPIOD10_DOUT</displayName>
          <description>GPIO PD.10 Bit Output/Input Value</description>
          <addressOffset>0x2E8</addressOffset>
       </register>
       <register derivedFrom="GPIOD0_DOUT">
          <name>GPIOD11_DOUT</name>
          <displayName>GPIOD11_DOUT</displayName>
          <description>GPIO PD.11 Bit Output/Input Value</description>
          <addressOffset>0x2EC</addressOffset>
       </register>
       <register derivedFrom="GPIOD0_DOUT">
          <name>GPIOD12_DOUT</name>
          <displayName>GPIOD12_DOUT</displayName>
          <description>GPIO PD.12 Bit Output/Input Value</description>
          <addressOffset>0x2F0</addressOffset>
       </register>
       <register derivedFrom="GPIOD0_DOUT">
          <name>GPIOD13_DOUT</name>
          <displayName>GPIOD13_DOUT</displayName>
          <description>GPIO PD.13 Bit Output/Input Value</description>
          <addressOffset>0x2F4</addressOffset>
       </register>
       <register derivedFrom="GPIOD0_DOUT">
          <name>GPIOD14_DOUT</name>
          <displayName>GPIOD14_DOUT</displayName>
          <description>GPIO PD.14 Bit Output/Input Value</description>
          <addressOffset>0x2F8</addressOffset>
       </register>
       <register derivedFrom="GPIOD0_DOUT">
          <name>GPIOD15_DOUT</name>
          <displayName>GPIOD15_DOUT</displayName>
          <description>GPIO PD.15 Bit Output/Input Value</description>
          <addressOffset>0x2FC</addressOffset>
       </register>
